tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46j13_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF46J13_H_
#define _PIC18LF46J13_H_

#define ADCTRIG                       0
#define TRIGSEL                       1
#define SRC                           2
#define TRIGSEL0                      3
#define SRC0                          4
#define TRIGSEL1                      5
#define SRC1                          6
#define PMDIS0                        7
#define PMDADC                        8
#define ADCMD                         9
#define SPI1MD                        10
#define PMDMSSP                       11
#define PMDMSSP1                      12
#define SPIMD                         13
#define SPI2MD                        14
#define PMDMSSP2                      15
#define PMDUART                       16
#define PMDUART1                      17
#define UARTMD                        18
#define UART1MD                       19
#define PMDUART2                      20
#define UART2MD                       21
#define PMDECCP                       22
#define ECCP1MD                       23
#define ECCPMD                        24
#define PMDECCP1                      25
#define ECCP2MD                       26
#define PMDECCP2                      27
#define ECCP3MD                       28
#define PMDECCP3                      29
#define PMDIS1                        30
#define PMDTMR                        31
#define TMRMD                         32
#define PMDTMR1                       33
#define TMR1MD                        34
#define PMDTMR2                       35
#define TMR2MD                        36
#define PMDTMR3                       37
#define TMR3MD                        38
#define PMDTMR4                       39
#define TMR4MD                        40
#define PMDRTCC                       41
#define RTCCMD                        42
#define CTMUMD                        43
#define PMDCTMU                       44
#define PMDPSP                        45
#define PSPMD                         46
#define PMDIS2                        47
#define CMP1MD                        48
#define PMDCMP                        49
#define CMPMD                         50
#define PMDCMP1                       51
#define PMDCMP2                       52
#define CMP2MD                        53
#define CMP3MD                        54
#define PMDCMP3                       55
#define PMDTMR5                       56
#define TMR5MD                        57
#define TMR6MD                        58
#define PMDTMR6                       59
#define PMDTMR8                       60
#define TMR8MD                        61
#define PMDIS3                        62
#define CCP4MD                        63
#define PMDCCP                        64
#define PMDCCP4                       65
#define CCPMD                         66
#define PMDCCP5                       67
#define CCP5MD                        68
#define CCP6MD                        69
#define PMDCCP6                       70
#define CCP7MD                        71
#define PMDCCP7                       72
#define CCP8MD                        73
#define PMDCCP8                       74
#define PMDCCP9                       75
#define CCP9MD                        76
#define PMDCCP10                      77
#define CCP10MD                       78
#define PPSCON                        79
#define IOLOCK                        80
#define CCP10CON                      81
#define CCP10M                        82
#define CCP10M0                       83
#define CCP10M1                       84
#define CCP10M2                       85
#define CCP10M3                       86
#define DC10B0                        87
#define DC10B                         88
#define DC10B1                        89
#define CCPR10L                       90
#define CCPR10H                       91
#define CCP9CON                       92
#define CCP9M0                        93
#define CCP9M                         94
#define CCP9M1                        95
#define CCP9M2                        96
#define CCP9M3                        97
#define DC9B0                         98
#define DC9B                          99
#define DC9B1                         100
#define CCPR9L                        101
#define CCPR9H                        102
#define CCP8CON                       103
#define CCP8M0                        104
#define CCP8M                         105
#define CCP8M1                        106
#define CCP8M2                        107
#define CCP8M3                        108
#define DC8B0                         109
#define DC8B                          110
#define DC8B1                         111
#define CCPR8L                        112
#define CCPR8H                        113
#define CCP7CON                       114
#define CCP7M0                        115
#define CCP7M                         116
#define CCP7M1                        117
#define CCP7M2                        118
#define CCP7M3                        119
#define DC7B                          120
#define DC7B0                         121
#define DC7B1                         122
#define CCPR7L                        123
#define CCPR7H                        124
#define CCP6CON                       125
#define CCP6M                         126
#define CCP6M0                        127
#define CCP6M1                        128
#define CCP6M2                        129
#define CCP6M3                        130
#define DC6B0                         131
#define DC6B                          132
#define DC6B1                         133
#define CCPR6L                        134
#define CCPR6H                        135
#define CCP5CON                       136
#define CCP5M0                        137
#define CCP5M                         138
#define CCP5M1                        139
#define CCP5M2                        140
#define CCP5M3                        141
#define DC5B0                         142
#define DC5B                          143
#define DC5B1                         144
#define CCPR5L                        145
#define CCPR5H                        146
#define CCP4CON                       147
#define CCP4M                         148
#define CCP4M0                        149
#define CCP4M1                        150
#define CCP4M2                        151
#define CCP4M3                        152
#define DC4B0                         153
#define DC4B                          154
#define DC4B1                         155
#define CCPR4L                        156
#define CCPR4H                        157
#define CCP3CON                       158
#define CCP3M                         159
#define CCP3M0                        160
#define CCP3M1                        161
#define CCP3M2                        162
#define CCP3M3                        163
#define DC3B                          164
#define DC3B0                         165
#define DC3B1                         166
#define P3M                           167
#define P3M0                          168
#define P3M1                          169
#define CCPR3L                        170
#define CCPR3H                        171
#define ECCP3DEL                      172
#define P3DC                          173
#define P3DC0                         174
#define P3DC1                         175
#define P3DC2                         176
#define P3DC3                         177
#define P3DC4                         178
#define P3DC5                         179
#define P3DC6                         180
#define P3RSEN                        181
#define PSS3BD0                       182
#define PSS3BD                        183
#define PSS3BD1                       184
#define PSS3AC0                       185
#define PSS3AC                        186
#define PSS3AC1                       187
#define ECCP3AS                       188
#define ECCP3AS0                      189
#define ECCP3AS1                      190
#define ECCP3AS2                      191
#define ECCP3ASE                      192
#define PSTR3CON                      193
#define PSTR3CON_STRA                 194
#define STRA3                         195
#define STRB3                         196
#define PSTR3CON_STRB                 197
#define PSTR3CON_STRC                 198
#define STRC3                         199
#define STRD3                         200
#define PSTR3CON_STRD                 201
#define STRSYNC3                      202
#define PSTR3CON_STRSYNC              203
#define CMPL                          204
#define PSTR3CON_CMPL0                205
#define CMPL03                        206
#define CMPL13                        207
#define PSTR3CON_CMPL1                208
#define T8CON                         209
#define T8CKPS0                       210
#define T8CKPS                        211
#define T8CKPS1                       212
#define TMR8ON                        213
#define T8OUTPS                       214
#define T8OUTPS0                      215
#define T8OUTPS1                      216
#define T8OUTPS2                      217
#define T8OUTPS3                      218
#define PR8                           219
#define TMR8                          220
#define T6CON                         221
#define T6CKPS0                       222
#define T6CKPS                        223
#define T6CKPS1                       224
#define TMR6ON                        225
#define T6OUTPS0                      226
#define T6OUTPS                       227
#define T6OUTPS1                      228
#define T6OUTPS2                      229
#define T6OUTPS3                      230
#define PR6                           231
#define TMR6                          232
#define T5GCON                        233
#define T5GSS                         234
#define T5GSS0                        235
#define T5GSS1                        236
#define T5GVAL                        237
#define T5DONE                        238
#define T5GGO_NOT_T5DONE              239
#define nT5DONE                       240
#define T5GGO_nT5DONE                 241
#define NOT_T5DONE                    242
#define T5GGO                         243
#define T5GSPM                        244
#define T5GTM                         245
#define T5GPOL                        246
#define TMR5GE                        247
#define T5CON                         248
#define TMR5ON                        249
#define T5CON_RD16                    250
#define RD165                         251
#define nT5SYNC                       252
#define NOT_T5SYNC                    253
#define SOSCEN5                       254
#define T5OSCEN                       255
#define T5CKPS                        256
#define T5CKPS0                       257
#define T5CKPS1                       258
#define TMR5CS0                       259
#define TMR5CS                        260
#define TMR5CS1                       261
#define TMR5L                         262
#define TMR5H                         263
#define CM3CON                        264
#define CM3CON_CCH                    265
#define CCH03                         266
#define CM3CON_CCH0                   267
#define CCH13                         268
#define CM3CON_CCH1                   269
#define CM3CON_CREF                   270
#define CREF3                         271
#define CM3CON_EVPOL                  272
#define EVPOL03                       273
#define CM3CON_EVPOL0                 274
#define CM3CON_EVPOL1                 275
#define EVPOL13                       276
#define CM3CON_CPOL                   277
#define CPOL3                         278
#define COE3                          279
#define CM3CON_COE                    280
#define CM3CON_CON                    281
#define CON3                          282
#define RTCVALL                       283
#define RTCVALH_WAITE0                284
#define RTCVALH                       285
#define RTCVALH_WAITE1                286
#define RTCVALH_WAITM0                287
#define RTCVALH_WAITM1                288
#define RTCVALH_WAITM2                289
#define RTCVALH_WAITM3                290
#define RTCVALH_WAITB0                291
#define RTCVALH_WAITB1                292
#define PADCFG1                       293
#define PMPTTL                        294
#define RTSECSEL0                     295
#define RTSECSEL1                     296
#define REFOCON                       297
#define RODIV0                        298
#define RODIV                         299
#define RODIV1                        300
#define RODIV2                        301
#define RODIV3                        302
#define ROSEL                         303
#define ROSSLP                        304
#define ROON                          305
#define RTCCAL                        306
#define CAL0                          307
#define CAL                           308
#define CAL1                          309
#define CAL2                          310
#define CAL3                          311
#define CAL4                          312
#define CAL5                          313
#define CAL6                          314
#define CAL7                          315
#define RTCCFG                        316
#define RTCPTR0                       317
#define RTCPTR1                       318
#define RTCOE                         319
#define HALFSEC                       320
#define RTCSYNC                       321
#define RTCWREN                       322
#define RTCEN                         323
#define ODCON3                        324
#define SPI1OD                        325
#define SPI2OD                        326
#define CTMUDS                        327
#define ODCON2                        328
#define U1OD                          329
#define U2OD                          330
#define CCP9OD                        331
#define CCP10OD                       332
#define ODCON1                        333
#define ECCP1OD                       334
#define ECCP2OD                       335
#define ECCP3OD                       336
#define CCP4OD                        337
#define CCP5OD                        338
#define CCP6OD                        339
#define CCP7OD                        340
#define CCP8OD                        341
#define ALRMVALL                      342
#define ALRMVALH                      343
#define ALRMRPT                       344
#define ARPT0                         345
#define ARPT                          346
#define ARPT1                         347
#define ARPT2                         348
#define ARPT3                         349
#define ARPT4                         350
#define ARPT5                         351
#define ARPT6                         352
#define ARPT7                         353
#define ALRMCFG                       354
#define ALRMPTR                       355
#define ALRMPTR0                      356
#define ALRMPTR1                      357
#define AMASK0                        358
#define AMASK                         359
#define AMASK1                        360
#define AMASK2                        361
#define AMASK3                        362
#define CHIME                         363
#define ALRMEN                        364
#define ANCON0                        365
#define PCFG0                         366
#define PCFG1                         367
#define PCFG2                         368
#define PCFG3                         369
#define PCFG4                         370
#define PCFG5                         371
#define PCFG6                         372
#define PCFG7                         373
#define ANCON1                        374
#define PCFG8                         375
#define PCFG9                         376
#define PCFG10                        377
#define PCFG11                        378
#define PCFG12                        379
#define PCFG15                        380
#define VBGEN                         381
#define DSWAKEL                       382
#define DSPOR                         383
#define DSMCLR                        384
#define DSRTC                         385
#define DSWDT                         386
#define DSULP                         387
#define DSFLT                         388
#define DSWAKEH                       389
#define DSINT0                        390
#define DSCONL                        391
#define RELEASE                       392
#define DSBOR                         393
#define ULPWDIS                       394
#define DSCONH                        395
#define RTCWDIS                       396
#define DSULPEN                       397
#define DSEN                          398
#define DSGPR0                        399
#define DSGPR1                        400
#define CCPTMRS2                      401
#define C8TSEL0                       402
#define C8TSEL                        403
#define C8TSEL1                       404
#define C9TSEL0                       405
#define C10TSEL0                      406
#define CCPTMRS1                      407
#define C4TSEL                        408
#define C4TSEL0                       409
#define C4TSEL1                       410
#define C5TSEL0                       411
#define C6TSEL0                       412
#define C7TSEL                        413
#define C7TSEL0                       414
#define C7TSEL1                       415
#define CCPTMRS0                      416
#define C1TSEL0                       417
#define C1TSEL                        418
#define C1TSEL1                       419
#define C1TSEL2                       420
#define C2TSEL0                       421
#define C2TSEL                        422
#define C2TSEL1                       423
#define C2TSEL2                       424
#define C3TSEL0                       425
#define C3TSEL                        426
#define C3TSEL1                       427
#define CVRCON                        428
#define CVR                           429
#define CVR0                          430
#define CVR1                          431
#define CVR2                          432
#define CVR3                          433
#define CVRSS                         434
#define CVRR                          435
#define CVROEN                        436
#define CVROE                         437
#define CVREN                         438
#define PMSTATL                       439
#define OB0E                          440
#define OB1E                          441
#define OB2E                          442
#define OB3E                          443
#define OBUF                          444
#define OBE                           445
#define PMSTATH                       446
#define IB0F                          447
#define IB1F                          448
#define IB2F                          449
#define IB3F                          450
#define IBOV                          451
#define IBF                           452
#define PMEL                          453
#define PTEN0                         454
#define PTENL                         455
#define PTEN1                         456
#define PTEN2                         457
#define PTEN3                         458
#define PTEN4                         459
#define PTEN5                         460
#define PTEN6                         461
#define PTEN7                         462
#define PMEH                          463
#define PTEN8                         464
#define PTENH                         465
#define PTEN9                         466
#define PTEN10                        467
#define PTEN11                        468
#define PTEN12                        469
#define PTEN13                        470
#define PTEN14                        471
#define PTEN15                        472
#define PMDIN2L                       473
#define PMDIN2L_DATAL                 474
#define PMDIN2H                       475
#define PMDIN2H_DATAH                 476
#define PMDOUT2L                      477
#define PMDOUT2L_DATAL                478
#define PMDOUT2H                      479
#define PMDOUT2H_DATAH                480
#define PMMODEL                       481
#define WAITE                         482
#define PMMODEL_WAITE0                483
#define PMMODEL_WAITE1                484
#define PMMODEL_WAITM0                485
#define WAITM                         486
#define PMMODEL_WAITM1                487
#define PMMODEL_WAITM2                488
#define PMMODEL_WAITM3                489
#define PMMODEL_WAITB0                490
#define WAITB                         491
#define PMMODEL_WAITB1                492
#define PMMODEH                       493
#define MODE0                         494
#define MODE1                         495
#define MODE16                        496
#define INCM0                         497
#define INCM1                         498
#define IRQM0                         499
#define IRQM1                         500
#define BUSY                          501
#define PMCONL                        502
#define RDSP                          503
#define WRSP                          504
#define BEP                           505
#define CS1P                          506
#define ALP                           507
#define CSF0                          508
#define CSF1                          509
#define PMCONH                        510
#define PTRDEN                        511
#define PTWREN                        512
#define PTBEEN                        513
#define ADRMUX0                       514
#define ADRMUX1                       515
#define PMPEN                         516
#define DMABCH                        517
#define DMACNTHB                      518
#define DMABCL                        519
#define DMACNTLB                      520
#define RXADDRH                       521
